import 'bootstrap/dist/css/bootstrap.min.css';
import Bitmap from '../../Img/Bitmap.png';
import Instructor1 from '../../Img/instructor.png';
import Instructor2 from '../../Img/instructor2.png';
import Pattern from '../../Img/pattern.png';
import { Button, Col, Container, Row } from 'react-bootstrap';
import './Seminars.css';
import Aos from 'aos';
import "aos/dist/aos.css";
import { useEffect } from 'react';

const Seminars = () => {

      useEffect(() => {
            Aos.init({duration : 1000})
      } , []);

      return (
            <div className='Seminars'>
                  <Container>
                        <Row>
                              <Col xs={12} md={6} data-aos="fade-left">
                                    <div className='seminar__about'>
                                          <div className='seminar-breadcrumb d-flex justify-content-space-between align-items-center'>
                                                <div className='seminar__links'>
                                                      <span>الرئيسية </span>
                                                      <span>الندوات </span>
                                                </div>
                                                <div className='seminar__favourite'>
                                                      <Button>أضف إلى المفضله</Button>
                                                      <svg width="22" height="20" viewBox="0 0 22 20" fill="#fff" xmlns="http://www.w3.org/2000/svg"><path fill-rule="evenodd" clip-rule="evenodd" d="M10.1495 19.6734C10.3848 19.8841 10.6868 20 11 20C11.313 20 11.6152 19.8841 11.8503 19.6738C12.7411 18.8778 13.5993 18.1304 14.3566 17.4711L14.3569 17.4708C16.5729 15.5411 18.4865 13.8747 19.8182 12.2327C21.3068 10.3974 22 8.65709 22 6.75591C22 4.90876 21.3803 3.20464 20.2549 1.95726C19.1161 0.695126 17.5532 0 15.8543 0C14.5844 0 13.4214 0.410249 12.3977 1.21926C11.8809 1.62762 11.4127 2.1274 11 2.71036C10.5874 2.1274 10.1191 1.62762 9.60251 1.21926C8.57881 0.410249 7.4158 0 6.14587 0C4.44676 0 2.88411 0.695126 1.74527 1.95726C0.619858 3.20464 0 4.90876 0 6.75591C0 8.65709 0.693375 10.3974 2.18201 12.2329C3.5137 13.8747 5.42766 15.5415 7.64407 17.4714L7.64793 17.4749C8.40392 18.1331 9.26077 18.8794 10.1495 19.6734ZM2.6926 2.84979C3.5847 1.86121 4.81099 1.31685 6.14587 1.31685C7.12358 1.31685 8.02139 1.63448 8.81413 2.26083C9.52077 2.81926 10.0129 3.52519 10.3013 4.01914C10.4496 4.27315 10.7108 4.42476 11 4.42476C11.2892 4.42476 11.5504 4.27315 11.6987 4.01914C11.9873 3.52519 12.4794 2.81926 13.1859 2.26083C13.9786 1.63448 14.8764 1.31685 15.8543 1.31685C17.189 1.31685 18.4155 1.86121 19.3074 2.84979C20.2128 3.85329 20.7114 5.24046 20.7114 6.75591C20.7114 8.35489 20.1299 9.78493 18.826 11.3927C17.5668 12.9453 15.6945 14.5758 13.5266 16.4639L13.5207 16.469C12.7604 17.1308 11.8988 17.8812 10.9982 18.6826C10.1029 17.8827 9.24265 17.1336 8.48381 16.4727L8.47978 16.4693L8.47851 16.4682C6.30846 14.5785 4.43426 12.9464 3.17415 11.3927C1.87015 9.78493 1.28856 8.35489 1.28856 6.75591C1.28856 5.24046 1.78723 3.85329 2.6926 2.84979Z" fill="#fff"/></svg>
                                                </div>
                                          </div>
                                          <div className='seminar__about-date'>
                                                <svg width="22" height="22" viewBox="0 0 28 27" fill="none" xmlns="http://www.w3.org/2000/svg">
                                          <ellipse cx="20.7879" cy="11.3906" rx="1.27273" ry="1.26562" fill="#51BFAD"/>
                                          <path d="M22.9091 2.10938H21.5303V1.05469C21.5303 0.472184 21.0555 0 20.4697 0C19.8839 0 19.4091 0.472184 19.4091 1.05469V2.10938H14.5833V1.05469C14.5833 0.472184 14.1085 0 13.5227 0C12.937 0 12.4621 0.472184 12.4621 1.05469V2.10938H7.68939V1.05469C7.68939 0.472184 7.21456 0 6.62879 0C6.04302 0 5.56818 0.472184 5.56818 1.05469V2.10938H4.24242C1.90315 2.10938 0 4.00191 0 6.32812V22.7812C0 25.1075 1.90315 27 4.24242 27H12.3561C12.9418 27 13.4167 26.5278 13.4167 25.9453C13.4167 25.3628 12.9418 24.8906 12.3561 24.8906H4.24242C3.07279 24.8906 2.12121 23.9444 2.12121 22.7812V6.32812C2.12121 5.16502 3.07279 4.21875 4.24242 4.21875H5.56818V5.27344C5.56818 5.85594 6.04302 6.32812 6.62879 6.32812C7.21456 6.32812 7.68939 5.85594 7.68939 5.27344V4.21875H12.4621V5.27344C12.4621 5.85594 12.937 6.32812 13.5227 6.32812C14.1085 6.32812 14.5833 5.85594 14.5833 5.27344V4.21875H19.4091V5.27344C19.4091 5.85594 19.8839 6.32812 20.4697 6.32812C21.0555 6.32812 21.5303 5.85594 21.5303 5.27344V4.21875H22.9091C24.0787 4.21875 25.0303 5.16502 25.0303 6.32812V12.3398C25.0303 12.9223 25.5051 13.3945 26.0909 13.3945C26.6767 13.3945 27.1515 12.9223 27.1515 12.3398V6.32812C27.1515 4.00191 25.2484 2.10938 22.9091 2.10938Z" fill="#51BFAD"/>
                                                <path fill-rule="evenodd" clip-rule="evenodd" d="M15.2727 20.6719C15.2727 17.1825 18.1274 14.3438 21.6363 14.3438C25.1453 14.3438 28 17.1825 28 20.6719C28 24.1612 25.1453 27 21.6363 27C18.1274 27 15.2727 24.1612 15.2727 20.6719ZM17.3764 20.6719C17.3764 23.0077 19.2874 24.9081 21.6363 24.9081C23.9853 24.9081 25.8963 23.0077 25.8963 20.6719C25.8963 18.336 23.9853 16.4357 21.6363 16.4357C19.2874 16.4357 17.3764 18.336 17.3764 20.6719Z" fill="#51BFAD"/><path d="M22.7738 19.8542H22.3311V18.7604C22.3311 18.1851 21.8907 17.7188 21.3474 17.7188C20.8041 17.7188 20.3636 18.1851 20.3636 18.7604V20.8958C20.3636 21.4711 20.8041 21.9375 21.3474 21.9375H22.7738C23.3172 21.9375 23.7576 21.4711 23.7576 20.8958C23.7576 20.3205 23.3172 19.8542 22.7738 19.8542Z" fill="#51BFAD"/>                                          <ellipse cx="16.5454" cy="11.3906" rx="1.27273" ry="1.26562" fill="#51BFAD"/><ellipse cx="11.4546" cy="15.6094" rx="1.27273" ry="1.26562" fill="#51BFAD"/><ellipse cx="6.36361" cy="11.3906" rx="1.27273" ry="1.26562" fill="#51BFAD"/><ellipse cx="6.36361" cy="15.6094" rx="1.27273" ry="1.26562" fill="#51BFAD"/><ellipse cx="6.36361" cy="19.8281" rx="1.27273" ry="1.26562" fill="#51BFAD"/><ellipse cx="11.4546" cy="19.8281" rx="1.27273" ry="1.26562" fill="#51BFAD"/><ellipse cx="11.4546" cy="11.3906" rx="1.27273" ry="1.26562" fill="#51BFAD"/></svg>
                                                <span>يوم الخميس ١٦ يوليو ٢٠٢٠ م من ٤ - ٦ مساءاً</span>
                                          </div>
                                          <div className='seminar__about-desc'>
                                                <p>ندعوكم في الجمعية المالية السعودية صفا لحضور المساحة الخاصة بمناقشة الميزانية العامة والاقتصاد المحلي، ننتظركم غدًا</p>
                                          </div>
                                          <Button className='seminar__about-booking'>حـجـز الأن</Button>
                                          <div className='seminar__about-instructors'>
                                                <h6>تـقـديـم المـحـاضـريـن</h6>
                                                <div className='seminar__instructors-data'>
                                                      <img src={Instructor1} alt=''/>
                                                      <div>
                                                            <h6>الدكتور رجـا المرزوقى</h6>
                                                            <p>نائب رئيس مجلس ادارة جمعية صفا  - استاذ الاقتصاد المشارك معهد الامير سعود الفيصل للدراسات الدبلوماسية</p>
                                                      </div>
                                                </div>
                                                <div className='seminar__instructors-data'>
                                                      <img src={Instructor2} alt=''/>
                                                      <div>
                                                            <h6>الدكتور رجـا المرزوقى</h6>
                                                            <p>نائب رئيس مجلس ادارة جمعية صفا  - استاذ الاقتصاد المشارك معهد الامير سعود الفيصل للدراسات الدبلوماسية</p>
                                                      </div>
                                                </div>
                                                <img className='seminar__pattern' src={Pattern} alt='' />
                                          </div>
                                    </div>
                              </Col>
                              <Col xs={12} md={6} data-aos="fade-right">
                                    <div className='seminar__img'>
                                          <img
                                                src={Bitmap}
                                                className=""
                                                alt="Bitmap"
                                          />
                                    </div>
                              </Col>
                        </Row>
                  </Container>
            </div>
      )
}

export default Seminars;