import 'bootstrap/dist/css/bootstrap.min.css';
import './Footer.css';
import LightLogo from '../../Img/logo.png';
import { Button, Col, Container, Form, FormControl, Row } from 'react-bootstrap';
import Aos from 'aos';
import "aos/dist/aos.css";
import { useEffect } from 'react';

const Footer = () => {
      useEffect(() => {
            Aos.init({duration : 1000})
      } , []);

      return (
            <div className='footer' data-aos="fade-up">
                  <div className='footer_section'>
                        <Container>
                              <Row>
                                    <Col xs={12} md={3}>
                                          <ul className='list'>
                                                <li>
                                                      <img src={LightLogo} alt=""/>
                                                </li>
                                                <li>Safa90@gmail.com</li>
                                                <li>+757 699-4478</li>
                                          </ul>
                                    </Col>
                                    <Col xs={12} md={4}>
                                          <h3 className='footer__ourlinks'>روابطنا</h3>
                                          <div className="footer__links d-flex">
                                                <ul className='list'>
                                                      <li><a href="#/">الرئيسيه</a></li>
                                                      <li><a href="#/">من نحن</a></li>
                                                      <li><a href="#/">الخدمات</a></li>
                                                      <li><a href="#/">الفعاليات</a></li>
                                                      <li><a href="#/">الكورسات</a></li>
                                                      <li><a href="#/">الندوات</a></li>
                                                </ul>
                                                <ul className='list'>
                                                      <li><a href="#/">الورشات</a></li>
                                                      <li><a href="#/">الأخبار</a></li>
                                                      <li><a href="#/">الأبحاث</a></li>
                                                      <li><a href="#/">فريق العمل</a></li>
                                                      <li><a href="#/">العضويه</a></li>
                                                      <li><a href="#/">اتصل بنا</a></li>
                                                </ul>
                                          </div>
                                    </Col>
                                    <Col xs={12} md={5}>
                                          <ul className='list'>
                                                <h3>تـابـعـنـا</h3>
                                                <li>
                                                      <ul className='list'>
                                                            <span className="footer__social d-flex">
                                                                  <svg width="18" height="18" viewBox="0 0 18 18" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M18 18V11.4437C18 8.22144 17.3093 5.76001 13.5658 5.76001C11.7609 5.76001 10.5577 6.74458 10.0675 7.6844H10.0229V6.05091H6.48001V18H10.1789V12.0702C10.1789 10.5038 10.4686 9.00462 12.3848 9.00462C14.2789 9.00462 14.3011 10.7724 14.3011 12.1597V17.9776H18V18Z" fill="white"/><path d="M0.720001 5.76001H4.32V18H0.720001V5.76001Z" fill="white"/><path d="M2.16 0C0.9675 0 0 0.962487 0 2.14881C0 3.33513 0.9675 4.32 2.16 4.32C3.3525 4.32 4.32 3.33513 4.32 2.14881C4.32 0.962487 3.3525 0 2.16 0Z" fill="white"/></svg>
                                                                  <svg width="26" height="16" viewBox="0 0 26 16" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M26 6.19042H23.5238V3.71423H21.0476V6.19042H18.5714V8.66661H21.0476V11.1428H23.5238V8.66661H26V6.19042Z" fill="white"/><path d="M7.89286 9.20833H13.0232C12.497 11.4446 10.3923 13.1548 7.89286 13.1548C4.99881 13.1548 2.63095 10.7869 2.63095 7.89286C2.63095 4.99881 4.99881 2.63095 7.89286 2.63095C9.33988 2.63095 10.6554 3.15714 11.5762 4.20952L13.4179 2.36786C11.9708 0.920833 9.99762 0 7.89286 0C3.55179 0 0 3.55179 0 7.89286C0 12.2339 3.55179 15.7857 7.89286 15.7857C12.2339 15.7857 15.7857 12.2339 15.7857 7.89286V6.57738H7.89286V9.20833Z" fill="white"/></svg>
                                                                  <svg width="19" height="16" viewBox="0 0 19 16" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M19 1.79785C18.2875 2.10138 17.5513 2.31152 16.7675 2.40492C17.575 1.93794 18.1925 1.19078 18.4775 0.280184C17.7175 0.723809 16.8862 1.02734 16.0075 1.21413C15.295 0.466974 14.2738 0 13.1575 0C10.9963 0 9.2625 1.7278 9.2625 3.82919C9.2625 4.13272 9.28625 4.4129 9.3575 4.69309C6.1275 4.553 3.2775 3.01198 1.35375 0.700461C-0.0237501 3.12873 1.52 5.13671 2.54125 5.81382C1.92375 5.81382 1.30625 5.62704 0.78375 5.34685C0.78375 7.2381 2.1375 8.80246 3.895 9.15269C3.515 9.26943 2.66 9.33948 2.1375 9.22273C2.63625 10.7404 4.085 11.8611 5.77125 11.8845C4.44125 12.9118 2.49375 13.729 0 13.4722C1.73375 14.5696 3.77625 15.2 5.985 15.2C13.1575 15.2 17.0525 9.36283 17.0525 4.31951C17.0525 4.15607 17.0525 3.99263 17.0287 3.82919C17.8363 3.24547 18.5012 2.56836 19 1.79785Z" fill="white"/></svg>
                                                                  <svg width="9" height="18" viewBox="0 0 9 18" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M2.5058 9.65219C2.44316 9.65219 1.06497 9.65219 0.438515 9.65219C0.104408 9.65219 0 9.52378 0 9.20275C0 8.34668 0 7.46921 0 6.61314C0 6.27071 0.12529 6.1637 0.438515 6.1637H2.5058C2.5058 6.0995 2.5058 4.8582 2.5058 4.28035C2.5058 3.42428 2.65197 2.61101 3.06961 1.86195C3.50812 1.09149 4.13457 0.577847 4.92807 0.278223C5.45012 0.085607 5.97216 0 6.53596 0H8.58237C8.87471 0 9 0.128411 9 0.428035V2.86783C9 3.16746 8.87471 3.29587 8.58237 3.29587C8.01856 3.29587 7.45476 3.29587 6.89095 3.31727C6.32715 3.31727 6.0348 3.59549 6.0348 4.19474C6.01392 4.8368 6.0348 5.45745 6.0348 6.1209H8.45708C8.79118 6.1209 8.91647 6.24931 8.91647 6.59174V9.18135C8.91647 9.52378 8.81207 9.63079 8.45708 9.63079C7.70534 9.63079 6.09745 9.63079 6.0348 9.63079V16.6078C6.0348 16.9716 5.93039 17.1 5.55452 17.1C4.67749 17.1 3.82135 17.1 2.94432 17.1C2.63109 17.1 2.5058 16.9716 2.5058 16.6506C2.5058 14.4034 2.5058 9.7164 2.5058 9.65219Z" fill="white"/></svg>
                                                            </span>
                                                      </ul>
                                                </li>
                                                <h3 className='footer__follow-news'>لمتابعه الأخبار</h3>
                                                <li>
                                                      <Form className="d-flex">
                                                            <FormControl
                                                                  type="search"
                                                                  placeholder=""
                                                                  className="footer__search me-2"
                                                                  aria-label="Search"
                                                            />
                                                            <Button className='footer__subscribe'>إشتراك</Button>
                                                      </Form>
                                                </li>
                                          </ul>
                                    </Col>
                              </Row>
                        
                        </Container>
                  </div>
                        <div className='Safa_title'>
                              <p> جميع الحقوق محفوظة لصفا&copy;</p>
                        </div>
            </div>
      )
}

export default Footer